tugas 10/benchmark_async_lb/test_result_200.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            44444

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      200
Time taken for tests:   0.688 seconds
Complete requests:      1000
Failed requests:        179
   (Connect: 0, Receive: 0, Length: 179, Exceptions: 0)
Non-2xx responses:      179
Total transferred:      21838 bytes
HTML transferred:       716 bytes
Requests per second:    1454.08 [#/sec] (mean)
Time per request:       137.544 [ms] (mean)
Time per request:       0.688 [ms] (mean, across all concurrent requests)
Transfer rate:          31.01 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   20  11.8     16      54
Processing:     2   75 149.3     15     529
Waiting:        0   62 153.3      0     527
Total:          6   95 154.3     32     562

Percentage of the requests served within a certain time (ms)
  50%     32
  66%     42
  75%     45
  80%     56
  90%    456
  95%    530
  98%    540
  99%    552
 100%    562 (longest request)