tugas 10/benchmark_async_lb/test_result_500.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            44444

Document Path:          /
Document Length:        0 bytes

Concurrency Level:      500
Time taken for tests:   0.553 seconds
Complete requests:      1000
Failed requests:        103
   (Connect: 0, Receive: 0, Length: 103, Exceptions: 0)
Non-2xx responses:      109
Total transferred:      13298 bytes
HTML transferred:       436 bytes
Requests per second:    1807.76 [#/sec] (mean)
Time per request:       276.585 [ms] (mean)
Time per request:       0.553 [ms] (mean, across all concurrent requests)
Transfer rate:          23.48 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0   88  48.2     91     173
Processing:     8   91  61.3     87     351
Waiting:        0   16  58.6      0     328
Total:         80  180  78.9    165     510

Percentage of the requests served within a certain time (ms)
  50%    165
  66%    169
  75%    173
  80%    176
  90%    337
  95%    364
  98%    504
  99%    507
 100%    510 (longest request)